#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>
```

Success! The configuration is valid.


```
</details>
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
module.network.data.aws_vpc_endpoint_service.logs: Reading...
data.aws_caller_identity.current: Reading...
module.network.data.aws_availability_zones.current: Reading...
module.network.data.aws_vpc_endpoint_service.s3: Reading...
module.network.data.aws_vpc_endpoint_service.ecr_dkr: Reading...
module.network.data.aws_vpc_endpoint_service.ecr_api: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=218317313594]
module.network.data.aws_availability_zones.current: Read complete after 0s [id=ap-northeast-1]
module.network.data.aws_vpc_endpoint_service.logs: Read complete after 0s [id=3976633944]
module.network.data.aws_vpc_endpoint_service.s3: Read complete after 0s [id=3691811387]
module.network.data.aws_vpc_endpoint_service.ecr_dkr: Read complete after 0s [id=2678992883]
module.network.data.aws_vpc_endpoint_service.ecr_api: Read complete after 0s [id=3124162414]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ecr.aws_ecr_lifecycle_policy.app will be created
  + resource "aws_ecr_lifecycle_policy" "app" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "古いイメージの削除"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 3
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "container-test-dev-backend"
    }

  # module.ecr.aws_ecr_lifecycle_policy.bastion will be created
  + resource "aws_ecr_lifecycle_policy" "bastion" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "古いイメージの削除"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 3
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "container-test-dev-bastion"
    }

  # module.ecr.aws_ecr_lifecycle_policy.front will be created
  + resource "aws_ecr_lifecycle_policy" "front" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "古いイメージの削除"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 3
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "container-test-dev-front"
    }

  # module.ecr.aws_ecr_repository.backend will be created
  + resource "aws_ecr_repository" "backend" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "container-test-dev-backend"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + encryption_configuration {
          + encryption_type = "AES256"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr.aws_ecr_repository.bastion will be created
  + resource "aws_ecr_repository" "bastion" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "container-test-dev-bastion"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + encryption_configuration {
          + encryption_type = "AES256"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr.aws_ecr_repository.front will be created
  + resource "aws_ecr_repository" "front" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "container-test-dev-front"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + encryption_configuration {
          + encryption_type = "AES256"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.network.aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "container-test-dev-igw"
        }
      + tags_all = {
          + "Name" = "container-test-dev-igw"
        }
      + vpc_id   = (known after apply)
    }

  # module.network.aws_route.public_igw will be created
  + resource "aws_route" "public_igw" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.network.aws_route_table.private_app will be created
  + resource "aws_route_table" "private_app" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "container-test-dev-private-app"
        }
      + tags_all         = {
          + "Name" = "container-test-dev-private-app"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table.private_aurora will be created
  + resource "aws_route_table" "private_aurora" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "container-test-dev-private-aurora"
        }
      + tags_all         = {
          + "Name" = "container-test-dev-private-aurora"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table.private_bastion will be created
  + resource "aws_route_table" "private_bastion" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "container-test-dev-private-bastion"
        }
      + tags_all         = {
          + "Name" = "container-test-dev-private-bastion"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table.private_endpoint will be created
  + resource "aws_route_table" "private_endpoint" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "container-test-dev-private-vpce"
        }
      + tags_all         = {
          + "Name" = "container-test-dev-private-vpce"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table.public_alb will be created
  + resource "aws_route_table" "public_alb" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "container-test-dev-public-alb"
        }
      + tags_all         = {
          + "Name" = "container-test-dev-public-alb"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table_association.private_app[0] will be created
  + resource "aws_route_table_association" "private_app" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.private_app[1] will be created
  + resource "aws_route_table_association" "private_app" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.private_aurora[0] will be created
  + resource "aws_route_table_association" "private_aurora" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.private_aurora[1] will be created
  + resource "aws_route_table_association" "private_aurora" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.private_bastion[0] will be created
  + resource "aws_route_table_association" "private_bastion" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.private_endpoint[0] will be created
  + resource "aws_route_table_association" "private_endpoint" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.private_endpoint[1] will be created
  + resource "aws_route_table_association" "private_endpoint" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.public_alb[0] will be created
  + resource "aws_route_table_association" "public_alb" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.public_alb[1] will be created
  + resource "aws_route_table_association" "public_alb" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_subnet.private_app[0] will be created
  + resource "aws_subnet" "private_app" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.8.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "container-test-dev-pri-app-sbn-a"
        }
      + tags_all                                       = {
          + "Name" = "container-test-dev-pri-app-sbn-a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.private_app[1] will be created
  + resource "aws_subnet" "private_app" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.9.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "container-test-dev-pri-app-sbn-c"
        }
      + tags_all                                       = {
          + "Name" = "container-test-dev-pri-app-sbn-c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.private_aurora[0] will be created
  + resource "aws_subnet" "private_aurora" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.16.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "container-test-dev-pri-autora-sbn-a"
        }
      + tags_all                                       = {
          + "Name" = "container-test-dev-pri-autora-sbn-a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.private_aurora[1] will be created
  + resource "aws_subnet" "private_aurora" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.17.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "container-test-dev-pri-autora-sbn-c"
        }
      + tags_all                                       = {
          + "Name" = "container-test-dev-pri-autora-sbn-c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.private_bastion[0] will be created
  + resource "aws_subnet" "private_bastion" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.240.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "container-test-dev-pri-bastion-sbn-a"
        }
      + tags_all                                       = {
          + "Name" = "container-test-dev-pri-bastion-sbn-a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.private_endpoint[0] will be created
  + resource "aws_subnet" "private_endpoint" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.248.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "container-test-dev-pri-vpce-sbn-a"
        }
      + tags_all                                       = {
          + "Name" = "container-test-dev-pri-vpce-sbn-a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.private_endpoint[1] will be created
  + resource "aws_subnet" "private_endpoint" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.249.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "container-test-dev-pri-vpce-sbn-c"
        }
      + tags_all                                       = {
          + "Name" = "container-test-dev-pri-vpce-sbn-c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.public_alb[0] will be created
  + resource "aws_subnet" "public_alb" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "container-test-dev-pub-alb-sbn-a"
        }
      + tags_all                                       = {
          + "Name" = "container-test-dev-pub-alb-sbn-a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.public_alb[1] will be created
  + resource "aws_subnet" "public_alb" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "container-test-dev-pub-alb-sbn-c"
        }
      + tags_all                                       = {
          + "Name" = "container-test-dev-pub-alb-sbn-c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_vpc_endpoint.to_ecr_api will be created
  + resource "aws_vpc_endpoint" "to_ecr_api" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.ecr.api"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "container-test-dev-vpce-ecr-api"
        }
      + tags_all              = {
          + "Name" = "container-test-dev-vpce-ecr-api"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)
    }

  # module.network.aws_vpc_endpoint.to_ecr_dkr will be created
  + resource "aws_vpc_endpoint" "to_ecr_dkr" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.ecr.dkr"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "container-test-dev-vpce-ecr-dkr"
        }
      + tags_all              = {
          + "Name" = "container-test-dev-vpce-ecr-dkr"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)
    }

  # module.network.aws_vpc_endpoint.to_logs will be created
  + resource "aws_vpc_endpoint" "to_logs" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.logs"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "container-test-dev-vpce-logs"
        }
      + tags_all              = {
          + "Name" = "container-test-dev-vpce-logs"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)
    }

  # module.network.aws_vpc_endpoint.to_s3 will be created
  + resource "aws_vpc_endpoint" "to_s3" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = (known after apply)
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "container-test-dev-vpce-s3"
        }
      + tags_all              = {
          + "Name" = "container-test-dev-vpce-s3"
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)
    }

  # module.network.aws_vpc_endpoint.to_secretsmanager will be created
  + resource "aws_vpc_endpoint" "to_secretsmanager" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.secretsmanager"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "container-test-dev-vpce-secretsmanager"
        }
      + tags_all              = {
          + "Name" = "container-test-dev-vpce-secretsmanager"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)
    }

  # module.network.aws_vpc_endpoint.to_ssm will be created
  + resource "aws_vpc_endpoint" "to_ssm" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.ssm"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "container-test-dev-vpce-ssm"
        }
      + tags_all              = {
          + "Name" = "container-test-dev-vpce-ssm"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)
    }

  # module.network.aws_vpc_endpoint.to_ssmmessages will be created
  + resource "aws_vpc_endpoint" "to_ssmmessages" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.ssmmessages"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "container-test-dev-vpce-ssmmessages"
        }
      + tags_all              = {
          + "Name" = "container-test-dev-vpce-ssmmessages"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)
    }

  # module.sg.aws_security_group.container will be created
  + resource "aws_security_group" "container" {
      + arn                    = (known after apply)
      + description            = "Security group for backend app"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "container-test-dev-sg-app-container"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "container-test-dev-sg-app-container"
        }
      + tags_all               = {
          + "Name" = "container-test-dev-sg-app-container"
        }
      + vpc_id                 = (known after apply)
    }

  # module.sg.aws_security_group.db will be created
  + resource "aws_security_group" "db" {
      + arn                    = (known after apply)
      + description            = "Security Group of database server"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "container-test-dev-sg-db"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "container-test-dev-sg-db"
        }
      + tags_all               = {
          + "Name" = "container-test-dev-sg-db"
        }
      + vpc_id                 = (known after apply)
    }

  # module.sg.aws_security_group.front_container will be created
  + resource "aws_security_group" "front_container" {
      + arn                    = (known after apply)
      + description            = "Security group for front container app"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "container-test-dev-sg-front-container"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "container-test-dev-sg-front-container"
        }
      + tags_all               = {
          + "Name" = "container-test-dev-sg-front-container"
        }
      + vpc_id                 = (known after apply)
    }

  # module.sg.aws_security_group.internal_alb will be created
  + resource "aws_security_group" "internal_alb" {
      + arn                    = (known after apply)
      + description            = "Security group for internal load balancer"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "container-test-dev-sg-internal-alb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "container-test-dev-sg-internal-alb"
        }
      + tags_all               = {
          + "Name" = "container-test-dev-sg-internal-alb"
        }
      + vpc_id                 = (known after apply)
    }

  # module.sg.aws_security_group.management will be created
  + resource "aws_security_group" "management" {
      + arn                    = (known after apply)
      + description            = "Security Group of management bastion server"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "container-test-dev-sg-management"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "container-test-dev-sg-management"
        }
      + tags_all               = {
          + "Name" = "container-test-dev-sg-management"
        }
      + vpc_id                 = (known after apply)
    }

  # module.sg.aws_security_group.public_alb will be created
  + resource "aws_security_group" "public_alb" {
      + arn                    = (known after apply)
      + description            = "Security Group of ingress"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP from VPC"
              + from_port        = 80
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "container-test-dev-sg-public-alb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "container-test-dev-sg-public-alb"
        }
      + tags_all               = {
          + "Name" = "container-test-dev-sg-public-alb"
        }
      + vpc_id                 = (known after apply)
    }

  # module.sg.aws_security_group.vpce will be created
  + resource "aws_security_group" "vpce" {
      + arn                    = (known after apply)
      + description            = "Security Group of VPC Endpoint"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "container-test-dev-sg-vpce"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "container-test-dev-sg-vpce"
        }
      + tags_all               = {
          + "Name" = "container-test-dev-sg-vpce"
        }
      + vpc_id                 = (known after apply)
    }

  # module.sg.aws_security_group_rule.container_from_sg_alb_internal_HTTP will be created
  + resource "aws_security_group_rule" "container_from_sg_alb_internal_HTTP" {
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.sg.aws_security_group_rule.db_from_sg_container will be created
  + resource "aws_security_group_rule" "db_from_sg_container" {
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3306
      + type                     = "ingress"
    }

  # module.sg.aws_security_group_rule.db_from_sg_front_container will be created
  + resource "aws_security_group_rule" "db_from_sg_front_container" {
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3306
      + type                     = "ingress"
    }

  # module.sg.aws_security_group_rule.db_from_sg_management will be created
  + resource "aws_security_group_rule" "db_from_sg_management" {
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3306
      + type                     = "ingress"
    }

  # module.sg.aws_security_group_rule.front_container_from_sg_public_alb_HTTP will be created
  + resource "aws_security_group_rule" "front_container_from_sg_public_alb_HTTP" {
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.sg.aws_security_group_rule.internal_alb_from_sg_front_container_HTTP will be created
  + resource "aws_security_group_rule" "internal_alb_from_sg_front_container_HTTP" {
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.sg.aws_security_group_rule.internal_alb_from_sg_management_HTTP will be created
  + resource "aws_security_group_rule" "internal_alb_from_sg_management_HTTP" {
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.sg.aws_security_group_rule.vpc_endpoint_from_sg_container_HTTPS will be created
  + resource "aws_security_group_rule" "vpc_endpoint_from_sg_container_HTTPS" {
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.sg.aws_security_group_rule.vpc_endpoint_from_sg_front_container_HTTPS will be created
  + resource "aws_security_group_rule" "vpc_endpoint_from_sg_front_container_HTTPS" {
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.sg.aws_security_group_rule.vpc_endpoint_from_sg_management_HTTPS will be created
  + resource "aws_security_group_rule" "vpc_endpoint_from_sg_management_HTTPS" {
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.vpc.aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = false
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = false
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "container-test-dev-vpc"
        }
      + tags_all                             = {
          + "Name" = "container-test-dev-vpc"
        }
    }

Plan: 56 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @yusa0730, Action: `pull_request`, Working Directory: `environments/dev`, Workflow: `dev terraform ci`*